archives/2024/Results/Verifications/S2427/bottleneck-determination/read_only/threads-16/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=16 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=
uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 243.28 qps: 3912.20 (r/w/o: 3424.03/0.00/488.16) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 248.82 qps: 3979.05 (r/w/o: 3481.42/0.00/497.63) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 257.40 qps: 4115.98 (r/w/o: 3601.28/0.00/514.70) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 252.69 qps: 4046.90 (r/w/o: 3541.43/0.00/505.48) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 263.10 qps: 4207.00 (r/w/o: 3680.90/0.00/526.10) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 251.70 qps: 4024.81 (r/w/o: 3521.41/0.00/503.40) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 252.90 qps: 4051.26 (r/w/o: 3545.47/0.00/505.80) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 250.10 qps: 3999.43 (r/w/o: 3499.22/0.00/500.20) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 252.90 qps: 4047.36 (r/w/o: 3541.47/0.00/505.90) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 240.10 qps: 3840.83 (r/w/o: 3360.72/0.00/480.10) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            352058
        write:                           0
        other:                           50294
        total:                           402352
    transactions:                        25147  (251.20 per sec.)
    queries:                             402352 (4019.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1036s
    total number of events:              25147

Latency (ms):
         min:                                   47.41
         avg:                                   63.65
         max:                                  382.99
         95th percentile:                       90.78
         sum:                              1600593.36

Threads fairness:
    events (avg/stddev):           1571.6875/1.79
    execution time (avg/stddev):   100.0371/0.03


real    1m40.366s
user    0m16.174s
sys     0m19.051s